# 常量

class Const:
    # 前锋位置
    FORWARD = ["ST", "RW", "RS", "LW", "CF", "LS", "LF", "RF"]

    # 中场位置
    MIDFIELD = ["RM", "LM", "LCM", "CM", "CDM",
                "CAM", "RAM", "RCM", "LDM", "LAM", "RDM"]

    # 后卫位置
    GUARD = ["RB", "CB", "LB", "RCB", "RWB", "LCB", "LWB"]

    # 门将位置
    GOALKEEPER = ["GK"]

    # 位置
    POSITIONS = ["前锋", "中场", "后卫", "门将"]

    # 星级
    STARS = {1: ("★",0),
             2: ("★×2",1),
             3: ("★×3",2),
             4: ("★×4",4),
             5: ("★×5",6),
             6: ("★×6",8),
             7: ("★×7",11),
             8: ("★×8",14),
             9: ("★×9",17),
             10: ("★×10",21),
    }


    # 颜色
    COLOR = {"w": "gray",
             "g": "green",
             "b": "blue",
             "p": "purple",
             "o": "orange",
             "r": "red"}

    # 状态
    STATUS = {0: "",
              1: "转会中",
              2: "比赛中"}

    # 特性
    STYLE = {
      "sniper": {
        "name" : "狙击手",
          "盘带" : 3,
          "射术" : 3
      },
      "finisher": {
        "name" : "终结者",
        "射术" : 3,
        "头球" : 3
      },
      "deadeye": {
        "name" : "恶魔眼",
        "短传" : 3,
        "长传" : 3,
        "射术" : 3
      },
      "marksman": {
        "name" : "神枪手",
        "盘带" : 2,
        "射术" : 2,
        "头球" : 2
      },
      "hawk": {
        "name" : "凤头鹰",
        "速度" : 2,
        "射术" : 2,
        "头球" : 2
      },
      "artist": {
        "name" : "艺术家",
        "盘带" : 3,
        "短传" : 3,
        "长传" : 3
      },
      "architect": {
        "name" : "建筑师",
        "短传" : 3,
        "长传" : 3,
        "头球" : 3
      },
      "powerhous": {
        "name" : "抢球机器",
        "抢断" : 3,
        "防守" : 3
      },
      "maestro": {
        "name" : "大师",
        "盘带" : 2,
        "短传" : 2,
        "长传" : 2,
        "射术" : 2
      },
      "engine": {
        "name" : "发动机",
        "盘带" : 2,
        "短传" : 2,
        "长传" : 2,
        "速度" : 2
      },
      "sentinal": {
        "name" : "哨兵",
        "防守" : 3,
        "头球" : 3
      },
      "guardian": {
        "name" : "护卫",
        "防守" : 3,
        "盘带" : 3
      },
      "gladiator": {
        "name" : "斗士",
        "射术" : 3,
        "防守" : 3
      },
      "backbone": {
        "name" : "骨干",
        "防守" : 2,
        "短传" : 2,
        "长传" : 2,
        "头球" : 2
      },
      "anchor": {
        "name" : "铁锚",
        "速度" : 2,
        "防守" : 2,
        "头球" : 2
      },
      "hunter": {
        "name" : "狩猎者",
        "射术" : 3,
        "速度" : 3
      },
      "catalyst": {
        "name" : "催化剂",
        "短传" : 3,
        "长传" : 3,
        "速度" : 3
      },
      "shadow": {
        "name" : "暗影",
        "射术" : 3,
        "防守" : 3
      },
      "speedster": {
        "name" : "疾速魔",
        "速度" : 6
      },
      "slugger": {
        "name" : "重炮手",
        "射术" : 3,
        "远射" : 3
      }
    }