# 常量

class Const:
    # 前锋位置
    FORWARD = ["ST", "RW", "RS", "LW", "CF", "LS", "LF", "RF"]

    # 中场位置
    MIDFIELD = ["RM", "LM", "LCM", "CM", "CDM",
                "CAM", "RAM", "RCM", "LDM", "LAM", "RDM"]

    # 后卫位置
    GUARD = ["RB", "CB", "LB", "RCB", "RWB", "LCB", "LWB"]

    # 门将位置
    GOALKEEPER = ["GK"]

    # 位置
    POSITIONS = ["前锋", "中场", "后卫", "门将"]

    # 星级
    STARS = {80: ("★", "/~w"), 81: ("★", "/~w"),
             82: ("★★", "/~g"), 83: ("★★", "/~g"),
             84: ("★★★", "/~b"), 85: ("★★★", "/~b"), 86: ("★★★", "/~b"),
             87: ("★★★★", "/~p"), 88: ("★★★★", "/~p"),
             89: ("★★★★★","/~o"), 90: ("★★★★★","/~o"),
             91: ("★★★★★","/~o"), 92: ("★★★★★","/~o"), 93: ("★★★★★","/~o")}

    # 颜色
    COLOR = {"w": "gray",
             "g": "green",
             "b": "blue",
             "p": "purple",
             "o": "orange"}
